9/data/attachments/3dbadf43e3e019be.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c5b21c29-f198-4567-aa82-797cd4783e46</nif:username>
            <nif:friendToBeAdded>Melissa_adult_Friend_40333_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>